{
  "metadata": {
    "date": "2026-02-12",
    "location": "Simulation Lab",
    "tags": [
      "physics",
      "renormalization-group",
      "universality",
      "wilson",
      "fixed-point"
    ],
    "source": "Wilson 1971, Wilson & Fisher 1972, Goldenfeld 1992 Lectures on Phase Transitions",
    "original_file": "renormalization_group_universality.md"
  },
  "protocol_steps": {
    "Purification": "Wilson's renormalization group (RG) begins with a radical act of purification: systematically integrating out short-wavelength fluctuations to reveal the essential long-wavelength physics. In momentum-shell RG, fluctuations with wavevectors in a thin shell Lambda/b < k < Lambda are integrated out, and the remaining degrees of freedom are rescaled to restore the original cutoff. This purification removes the irrelevant microscopic details — lattice structure, interaction shape, higher-order couplings — leaving only the relevant and marginal operators that control the critical behavior. Kadanoff's original block-spin picture makes this physical: coarse-graining the lattice by replacing blocks of spins with a single effective spin strips away short-distance structure.",
    "Containment": "The space of all possible Hamiltonians serves as the container for the RG flow. Each point in this infinite-dimensional space represents a different physical system. The RG transformation maps one Hamiltonian to another — the coarse-grained effective Hamiltonian. The flow is contained within this space: under repeated coarse-graining, the system traces a trajectory through Hamiltonian space. The infrared cutoff (set by system size or correlation length) provides physical containment: the RG flow terminates when all fluctuations above this scale have been integrated out.",
    "Anchoring": "The fixed point of the RG flow is the anchor. At a fixed point, the Hamiltonian is invariant under coarse-graining: H* = R(H*), where R is the RG transformation. The fixed point Hamiltonian describes a system that looks the same at every length scale — it is scale-invariant. This invariance is the anchor that persists through the RG flow. No matter where in the basin of attraction a system starts, the RG flow carries it toward the fixed point. The fixed point is the invariant structure that governs all systems in the same universality class.",
    "Dissolution": "As the RG flow progresses, the irrelevant couplings in the Hamiltonian are driven to zero — they dissolve under coarse-graining. A system that began with a specific lattice structure, specific interaction range, specific higher-order couplings loses these features one by one. What dissolves is precisely the microscopic identity of the system: after sufficient coarse-graining, an Ising model on a square lattice is indistinguishable from one on a triangular lattice, or from a lattice gas, or from a binary alloy. The details that distinguished these systems are the \"irrelevant operators\" in the RG sense — they dissolve under the RG flow.",
    "Liminality": "The fixed point itself is the liminal state of the RG. It is the Hamiltonian that is neither flowing toward the ordered phase nor toward the disordered phase — it is at the boundary between these basins of attraction. The linearized RG around the fixed point reveals the critical exponents through the eigenvalues of the linearized transformation: the relevant eigenvalues (greater than 1) control the approach to the fixed point, and their logarithms give the critical exponents. The fixed point is unstable in the relevant directions — the system must be precisely at the critical point to remain there. This instability is the essence of liminality: the fixed point is a saddle point in Hamiltonian space.",
    "Encounter": "Wilson's key insight — the encounter — was that the problem of critical phenomena could be reformulated as a problem about the geometry of RG flows in Hamiltonian space. What had appeared as an intractable many-body problem (the divergence of the correlation length, the breakdown of perturbation theory at d=4) was revealed as a problem in dynamical systems theory. The epsilon-expansion (d = 4 - epsilon) provided systematic access to the fixed point in dimensions close to 4, making quantitative predictions possible for the first time. This reformulation earned Wilson the 1982 Nobel Prize — it was not a solution within the old framework but a fundamentally new framework.",
    "Integration": "Universality is the integration principle of the RG. Systems with the same dimensionality, symmetry, and range of interactions flow to the same fixed point — they have the same critical exponents, the same scaling functions, the same singular behavior near the critical point. This integrates an enormous diversity of physical systems into a small number of universality classes. The Ising universality class contains: uniaxial ferromagnets, the liquid-gas critical point, binary mixtures, lattice gases, and the beta-brass order-disorder transition. All are described by the same fixed-point Hamiltonian — their microscopic differences are irrelevant.",
    "Emergence": "The emergent structure is universality itself — the fact that macroscopic critical behavior is determined by a small number of properties (d, symmetry, interaction range) and is independent of all other microscopic details. This is perhaps the deepest result in statistical physics: the long-distance physics at a critical point is simpler than the microscopic physics that generates it. The RG explains why: irrelevant operators dissolve under coarse-graining, leaving only the universal content. The critical exponents are not properties of any particular material — they are properties of the fixed point, which is a mathematical object that transcends any specific physical realization."
  }
}